#+HUGO_BASE_DIR: ../
#+HUGO_SECTION: post
#+TITLE: PyTorch 入门
#+DATE: 2019-03-17
#+AUTHOR:
#+HUGO_CUSTOM_FRONT_MATTER: :author "xhcoding"
#+HUGO_TAGS: Python
#+HUGO_CATEGORIES: Python
#+HUGO_DRAFT: false


** Tensor 的创建修改
- 创建一个未初始化的 5*3 的 Tensor
#+BEGIN_SRC python
import torch
torch.empty(5, 3)
#+END_SRC

#+RESULTS:
: tensor([[ 9.5708e+07,  3.0709e-41,  6.3358e-01],
:         [ 7.7766e-01, -2.0187e-01, -8.6674e-01],
:         [-5.1109e-01, -1.0250e+00, -9.1226e-01],
:         [ 2.3205e-01,  5.3887e-01, -1.2480e-01],
:         [-1.0433e+00,  1.2003e+00, -6.7501e-01]])

- 初始化一个随机 5*3 矩阵
#+BEGIN_SRC python
torch.rand(5, 3)
#+END_SRC

#+RESULTS:
: tensor([[0.0390, 0.5990, 0.0840],
:         [0.6614, 0.7563, 0.2282],
:         [0.0315, 0.6136, 0.1151],
:         [0.6960, 0.7748, 0.0595],
:         [0.2393, 0.2217, 0.3775]])

- 初始化一个全零 5*3 矩阵，类型为 long
#+BEGIN_SRC python
torch.zeros(5, 3, dtype=torch.long)
#+END_SRC

#+RESULTS:
: tensor([[0, 0, 0],
:         [0, 0, 0],
:         [0, 0, 0],
:         [0, 0, 0],
:         [0, 0, 0]])

- 用数据初始化一个 tensor
#+BEGIN_SRC python
torch.tensor([5.3, 4.6])
#+END_SRC

#+RESULTS:
: tensor([5.3000, 4.6000])

- 从一个存在的 tensor 创建一个 tensor
#+BEGIN_SRC python
x = torch.tensor([5.3, 4.6])
x = x.new_ones(5, 3, dtype=torch.double)
print(x)

x = torch.randn_like(x, dtype=torch.float)
print(x)

#+END_SRC

#+RESULTS:
#+begin_example
tensor([[1., 1., 1.],
        [1., 1., 1.],
        [1., 1., 1.],
        [1., 1., 1.],
        [1., 1., 1.]], dtype=torch.float64)
tensor([[ 0.3986, -0.6534, -1.4937],
        [-0.2801,  0.0836, -1.0442],
        [-0.7142,  0.0531,  1.1577],
        [-0.6354,  0.3266, -1.3960],
        [ 1.7434,  1.7014,  0.4675]])
#+end_example

- 返回大小
#+BEGIN_SRC python
x.size()
#+END_SRC

#+RESULTS:
: torch.Size([5, 3])

*** 运算（如加法）
- +号
  #+BEGIN_SRC python
x = torch.rand(5, 3)
y = torch.rand(5, 3)
print(x + y)
  #+END_SRC

  #+RESULTS:
  : tensor([[0.9469, 0.3852, 1.5441],
  :         [0.4680, 0.5465, 1.4358],
  :         [1.1088, 0.9111, 1.7751],
  :         [0.6542, 0.4761, 0.4270],
  :         [0.1642, 1.5561, 0.7222]])

-  torch.add
  #+BEGIN_SRC python
torch.add(x, y)
  #+END_SRC

  #+RESULTS:
  : tensor([[0.9469, 0.3852, 1.5441],
  :         [0.4680, 0.5465, 1.4358],
  :         [1.1088, 0.9111, 1.7751],
  :         [0.6542, 0.4761, 0.4270],
  :         [0.1642, 1.5561, 0.7222]])

- 提供一个参数保存结果
  #+BEGIN_SRC python
result = torch.empty(5, 3)
torch.add(x, y, out=result)
print(result)
  #+END_SRC

  #+RESULTS:
  : tensor([[0.9469, 0.3852, 1.5441],
  :         [0.4680, 0.5465, 1.4358],
  :         [1.1088, 0.9111, 1.7751],
  :         [0.6542, 0.4761, 0.4270],
  :         [0.1642, 1.5561, 0.7222]])

- 原地相加
  #+BEGIN_SRC python
y.add_(x)
print(y)
  #+END_SRC

  #+RESULTS:
  : tensor([[0.9469, 0.3852, 1.5441],
  :         [0.4680, 0.5465, 1.4358],
  :         [1.1088, 0.9111, 1.7751],
  :         [0.6542, 0.4761, 0.4270],
  :         [0.1642, 1.5561, 0.7222]])

*** 改变维度，类似 numpy 中的 reshape
使用 =tensor.view= 改变 =tensor= 的大小。
#+BEGIN_SRC python
x = torch.randn(4, 4)
y = x.view(16)
z = x.view(-1, 8)  # -1 被推断成其它维度
print(x.size(), y.size(), z.size())
#+END_SRC

#+RESULTS:
: torch.Size([4, 4]) torch.Size([16]) torch.Size([2, 8])

*** 返回值
对于只有一个元素的 =tensor= 通过 =.item()= 得到它的值
#+BEGIN_SRC python
x = torch.randn(1)
print(x)
print(x.item())
#+END_SRC

#+RESULTS:
: tensor([-1.7529])
: -1.7529343366622925
*** Tensor 转换成 Numpy
#+BEGIN_SRC python
a = torch.ones(5)
print(a)
#+END_SRC

#+RESULTS:
: tensor([1., 1., 1., 1., 1.])

#+BEGIN_SRC python
b = a.numpy()
print(b)
#+END_SRC

#+RESULTS:
: [1. 1. 1. 1. 1.]

a 和 b 共享内存

#+BEGIN_SRC python
a.add_(1)
print(a)
print(b)
#+END_SRC

#+RESULTS:
: tensor([2., 2., 2., 2., 2.])
: [2. 2. 2. 2. 2.]

*** Numpy 转换成 Tensor
#+BEGIN_SRC python
import numpy as np
a = np.ones(5)
b = torch.from_numpy(a)
np.add(a, 1, out=a)
print(a)
print(b)
#+END_SRC

#+RESULTS:
: [2. 2. 2. 2. 2.]
: tensor([2., 2., 2., 2., 2.], dtype=torch.float64)

*** CUDA Tensor
Tensor 可以移动到任意设备，通过 =.to= 方法
#+BEGIN_SRC python
if (torch.cuda.is_available()):
    device = torch.device('cuda')
    y = torch.ones_like(x, device=device)
    x = x.to(device)
    z = x + y
    print(z)
    print(z.to('cpu', torch.double))
#+END_SRC

#+RESULTS:
: tensor([-0.7529], device='cuda:0')
: tensor([-0.7529], dtype=torch.float64)

